In [3]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [14]:
ser = pd.Series(dtype='int64')

In [15]:
print("{}".format(ser))

Series([], dtype: int64)

In [16]:
ser = pd.Series(10)
print("{}".format(ser))

0    10
dtype: int64

In [17]:
ser = pd.Series([25, 46, 85, 45, 69, 54])
print("{}".format(ser))

0    25
1    46
2    85
3    45
4    69
5    54
dtype: int64

In [20]:
ser = pd.Series([[25, 45], [85, 41], [65, 78]])
print("{}".format(ser))

0    [25, 45]
1    [85, 41]
2    [65, 78]
dtype: object

In [21]:
ser.describe()

count            3
unique           3
top       [25, 45]
freq             1
dtype: object

In [22]:
ser.to_csv('myfirstarray.csv', index = False)

In [23]:
arr =  pd.read_csv('myfirstarray.csv')

In [24]:
arr

          0
0  [25, 45]
1  [85, 41]
2  [65, 78]

In [29]:
arr1 = [25, 45, 85, 47, 65, 85, 75, 23, 45, 65, 78]
arr2 = [74, 85, 654, 45, 15, 74, 12, 54, 78, 69, 25]

df = pd.DataFrame([arr1, arr2], index = ['row 1', 'row 2'], columns = [i for i in range(len(arr1))])

df

       0   1    2   3   4   5   6   7   8   9   10
row 1  25  45   85  47  65  85  75  23  45  65  78
row 2  74  85  654  45  15  74  12  54  78  69  25

In [33]:
arr3 = [74, 85, 654, 45, 15, 74, 12, 54, 78]

df2 = df.append(pd.Series(arr3), ignore_index = True)

In [34]:
df2

     0     1      2     3     4     5     6     7     8     9     10
0  25.0  45.0   85.0  47.0  65.0  85.0  75.0  23.0  45.0  65.0  78.0
1  74.0  85.0  654.0  45.0  15.0  74.0  12.0  54.0  78.0  69.0  25.0
2  74.0  85.0  654.0  45.0  15.0  74.0  12.0  54.0  78.0   NaN   NaN

In [35]:
import copy

In [36]:
df_copy = copy.copy(df2)

In [37]:
df_copy.drop(index = 1)

     0     1      2     3     4     5     6     7     8     9     10
0  25.0  45.0   85.0  47.0  65.0  85.0  75.0  23.0  45.0  65.0  78.0
2  74.0  85.0  654.0  45.0  15.0  74.0  12.0  54.0  78.0   NaN   NaN

In [40]:
df_copy.drop(labels = 0, axis = 1)

     1      2     3     4     5     6     7     8     9     10
0  45.0   85.0  47.0  65.0  85.0  75.0  23.0  45.0  65.0  78.0
1  85.0  654.0  45.0  15.0  74.0  12.0  54.0  78.0  69.0  25.0
2  85.0  654.0  45.0  15.0  74.0  12.0  54.0  78.0   NaN   NaN

In [46]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\91931\anaconda3\envs\tensorflow_env\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\users\91931\anaconda3\envs\tensorflow_env\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\91931\anaconda3\envs\tensorflow_env\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\91931\anaconda3\envs\tensorflow_env\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\91931\anaconda3\envs\tensorflow_env\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)